tutorials/twoFluidsNBSuspensionFoam/channel1D/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
convertToMeters 1e-06;

Hx  15;
Hy  90;
Hz  30;

vertices
(

    name v0 (0 0 0)
    name v1 ( $Hx 0 0)
    name v2 ( $Hx  $Hy 0)
    name v3 (0  $Hy 0)

    name v4 (0 0 $Hz)
    name v5 ( $Hx 0 $Hz)
    name v6 ( $Hx  $Hy $Hz)
    name v7 (0  $Hy $Hz)

);

blocks
(
  hex (v0 v1 v2 v3 v4 v5 v6 v7) (10 60 20 )  simpleGrading (1 1 1)
);

edges
(
);

boundary
(
/*
    inlet
    {
        type patch;
        faces
        (
            (v0 v3 v7 v4)
        );
    }

    outlet
    {
        type patch;
        faces
        (
           (v1 v5 v6 v2)
        );
    }
*/
    walls
    {
        type walls;
        faces
        (
            (v0 v1 v2 v3)
            (v4 v7 v6 v5)
            (v0 v1 v5 v4)
            (v3 v2 v6 v7)
        );
    }

   cyc_in
    {
        type cyclic;
        neighbourPatch cyc_out;
        faces
        (
            (v0 v3 v7 v4)
        );
    }

    cyc_out
    {
        type cyclic;
        neighbourPatch cyc_in;
        faces
        (
           (v1 v5 v6 v2)
        );
    }


);

// ************************************************************************* //
