tutorials/twoFluidsNBSuspensionFoam/channel1D/0/Q.particles
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    object      Q.particles;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions          [0 0 0 0 0 0 0];

internalField       uniform (0 0 0 0 0 0);

boundaryField
{
    "walls"
    {
        type               zeroGradient;
        value              $internalField;
    }

    "inlet|outlet"
    {

        type               zeroGradient;
        value              $internalField;

    }

    "cyc.*"
    {
        type cyclic;
    }

}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
