tutorials/twoFluidsNBSuspensionFoam/channel1D/0/Theta.particles
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      Theta.particles;
}
// ************************************************************************* //

dimensions          [0 2 -2 0 0 0 0];

internalField       uniform 0;

referenceLevel     0;

boundaryField
{
    inlet
    {
        type               fixedValue;
        value              uniform 0;
    }

    outlet
    {
        type               zeroGradient;
    }


    "cyc.*"
    {
        type cyclic;
    }


    "walls"
    {
        type               zeroGradient;
    }



}

// ************************************************************************* //
